# Задание 6
# Николай – оригинальный человек.
# Он решил создать класс Nikola, принимающий при инициализации 2 параметра: имя и возраст. Но на этом он не успокоился.
# Не важно, какое имя передаст пользователь при создании экземпляра, оно всегда будет содержать “Николая”.
# В частности - если пользователя на самом деле зовут Николаем, то с именем ничего не произойдет, а если
# его зовут, например, Максим, то оно преобразуется в “Я не Максим, а Николай”.
# Более того, никаких других атрибутов и методов у экземпляра не может быть добавлено, даже если кто-то и
# вздумает так поступить (т.е. если некий пользователь решит прибавить к экземпляру свойство «отчество» или
# метод «приветствие», то ничего у такого хитреца не получится).


class Nikola:
    __slots__ = ["name", "age"]

    def __init__(self, name:str, age:int):
        name = name if name.lower() == "николай" else f"Я не {name}, а Николай"
        super(Nikola, self).__setattr__("name", name)
        super(Nikola, self).__setattr__("age", age)

    def __setattr__(self, name, value):
        raise AttributeError("Так нельзя делать!")


a = Nikola("Николай", 123)

print(a.name)
print(a.age)

try:
    a.surname = "Губанов"
except AttributeError as e:
    print(e)

try:
    a.greet = lambda self: print(self.name)
    a.greet(a)
except AttributeError as e:
    print(e)
